Terraform plan for __staging__
<details>
<summary>Plan: 1 to add, 8 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # aws_servicequotas_service_quota.minimum_quotas["vpc/L-45FE3B85"] will be updated in-place
  ~ resource "aws_servicequotas_service_quota" "minimum_quotas" {
        id             = "vpc/L-45FE3B85"
      ~ value          = 510 -> 20
        # (8 unchanged attributes hidden)
    }

  # aws_servicequotas_service_quota.minimum_quotas["vpc/L-A4707A72"] will be updated in-place
  ~ resource "aws_servicequotas_service_quota" "minimum_quotas" {
        id             = "vpc/L-A4707A72"
      ~ value          = 510 -> 20
        # (8 unchanged attributes hidden)
    }

  # aws_servicequotas_service_quota.minimum_quotas["vpc/L-F678F1CE"] will be updated in-place
  ~ resource "aws_servicequotas_service_quota" "minimum_quotas" {
        id             = "vpc/L-F678F1CE"
      ~ value          = 510 -> 20
        # (8 unchanged attributes hidden)
    }

  # cloudfoundry_user_provided_service.ssb-solrcloud-k8s will be updated in-place
  ~ resource "cloudfoundry_user_provided_service" "ssb-solrcloud-k8s" {
      ~ credentials_json = (sensitive value)
        id               = "f9f9f40d-912e-4b30-99c4-2704dc39081c"
        name             = "ssb-solrcloud-k8s"
        tags             = []
        # (1 unchanged attribute hidden)
    }

  # module.brokerpak-eks-terraform.module.bind.data.aws_eks_cluster.main will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster" "main"  {
      ~ arn                       = "arn:aws:eks:us-west-2:054110281448:cluster/k8s-d6e0b7fc580c3a4d" -> (known after apply)
      ~ certificate_authority     = [
          - {
              - data = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUM1ekNDQWMrZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJeU1ETXdNekUyTkRnek1Gb1hEVE15TURJeU9URTJORGd6TUZvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBTmNDCmRXWldQWGsrR0NPYkFEWlFObTZJTG4veHpuVGhnKzR1SUhCUjd3c213NUErRExIQlFlNi96Qjhqck9hNXFHdUIKMlNiS3FTaXRBT1ZTOTdxNEdLWXZKekV2bG1uVks2Lzg0ZWx4eXJjL2FFZWxjdmZLZE84NGtwTGNPeE9lWUpEYwpRVTZwZlFxN2FoejhLRkxvSnQvR3NlUi9VYzl0NjdkczZsNUVqTkZuam1IMEZ3bjZNaWxCcjlUWXZiSmsrYmF3CkwzeXErSjU1K1kyNnc5TXFzci9uOHFJQ0YyaUp5Y2lMMWJDOG5CUnp4NmVMOWhqekc1VzBpQVcvaHV5OVUxR3gKTGRxMytMU3pBNXRtekhRekpHekg3bUdVaEdJWi9xQkpwc3orRUhSeFdWVmhJWGVpSWNnWExKcmgzNWxaOFlDaApkSnVxb1ZlbmRONC96NzFZR0lFQ0F3RUFBYU5DTUVBd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0hRWURWUjBPQkJZRUZDdHB5TzErZ3VPNTc3TGl3ODBiR20xdkt6Q2RNQTBHQ1NxR1NJYjMKRFFFQkN3VUFBNElCQVFBaWNKV1ZqaDBxd1dFRWdsK2gvMm1BNzdUWFdEN0ltc3dHWE9PNUcwMGErcGtJU0R2bgpPbGpQQ2dxb3dpYmFQaTZrZjB0ZlFmTzc2UUp5eWJxV01Bai96bSs3Z3l4RGVSVGFkVGRablNRRG9sbDBDRnZmCkl5WlZESzJWZThXclUrVGJFT3lCSWk0ejFYV1JkeWx1M3R0WDZENXdBWFo1di84Z0ZWV3kzbDhzQ3BINmhYUk8KTUZlbUlvR0dXUFROYXg0a3BWcGFROHE4M1VFNGxMcnlWTGFGTEhjZStkQzlOS1dTc2xMVnRwa205TmFxVHpiNApZcHJZYklmWnUrRm1TS2ZyYU5xanFDUlJxb045c2VEeG53TUMvbFVReTQ4SG9ZSFhoRjhxUXdVaFZnN0M2dFoyCmVXZkFQcVFaUG1mWEZvb2V4akRRUHpHNG1BWVFBS1p6RXFvYgotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
            },
        ] -> (known after apply)
      ~ created_at                = "2022-03-03 16:42:30.494 +0000 UTC" -> (known after apply)
      ~ enabled_cluster_log_types = [
          - "api",
          - "audit",
          - "authenticator",
          - "controllerManager",
          - "scheduler",
        ] -> (known after apply)
      ~ endpoint                  = "https://E97035E8E3B7536C8E5BAEA9123ECC97.gr7.us-west-2.eks.amazonaws.com" -> (known after apply)
      ~ id                        = "********************" -> (known after apply)
      ~ identity                  = [
          - {
              - oidc = [
                  - {
                      - issuer = "https://oidc.eks.us-west-2.amazonaws.com/id/E97035E8E3B7536C8E5BAEA9123ECC97"
                    },
                ]
            },
        ] -> (known after apply)
      ~ kubernetes_network_config = [
          - {
              - ip_family         = "ipv4"
              - service_ipv4_cidr = "172.20.0.0/16"
            },
        ] -> (known after apply)
        name                      = "k8s-d6e0b7fc580c3a4d"
      ~ platform_version          = "eks.4" -> (known after apply)
      ~ role_arn                  = "arn:aws:iam::054110281448:role/k8s-d6e0b7fc580c3a4d-cluster-20220303163904249300000004" -> (known after apply)
      ~ status                    = "ACTIVE" -> (known after apply)
      ~ tags                      = {
          - "domain" = "solrcloud-k8s.ssb-staging.data.gov"
        } -> (known after apply)
      ~ version                   = "1.21" -> (known after apply)
      ~ vpc_config                = [
          - {
              - cluster_security_group_id = "********************"
              - endpoint_private_access   = false
              - endpoint_public_access    = true
              - public_access_cidrs       = [
                  - "0.0.0.0/0",
                ]
              - security_group_ids        = [
                  - "sg-033458e536cdfbf6e",
                ]
              - subnet_ids                = [
                  - "subnet-095181b79768c6bb2",
                  - "subnet-0ae384f0e2f4fdf5a",
                  - "subnet-0fb9117ab72a85725",
                ]
              - vpc_id                    = "*********************"
            },
        ] -> (known after apply)
    }

  # module.brokerpak-eks-terraform.module.bind.data.aws_eks_cluster_auth.main will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster_auth" "main"  {
      ~ id    = "********************" -> (known after apply)
        name  = "k8s-d6e0b7fc580c3a4d"
      ~ token = (sensitive value)
    }

  # module.brokerpak-eks-terraform.module.bind.data.kubernetes_secret.secret will be read during apply
  # (config refers to values not yet known)
 <= data "kubernetes_secret" "secret"  {
      ~ data      = (sensitive value)
      ~ id        = "************************************" -> (known after apply)
      ~ immutable = false -> (known after apply)
      ~ type      = "kubernetes.io/service-account-token" -> (known after apply)

      ~ metadata {
          - annotations      = {} -> null
          ~ generation       = 0 -> (known after apply)
          - labels           = {} -> null
            name             = "a4b24fc558d22fbd-token-hzcjg"
          ~ resource_version = "6289" -> (known after apply)
          ~ uid              = "ee489a7d-243a-42ed-a905-5891c4439a51" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # module.brokerpak-eks-terraform.module.bind.data.template_file.kubeconfig will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "kubeconfig"  {
      ~ id       = "****************************************************************" -> (known after apply)
      ~ rendered = <<-EOT
            apiVersion: v1
            kind: Config
            users:
            - name: a4b24fc558d22fbd
              user:
                token: eyJhbGciOiJSUzI1NiIsImtpZCI6IlZ4NXZ4N1l2UWduclh5VFJwdU84VnBac0hCUGFSbzNrTVNFTk9WOTFhbmcifQ.eyJpc3MiOiJrdWJlcm5ldGVzL3NlcnZpY2VhY2NvdW50Iiwia3ViZXJuZXRlcy5pby9zZXJ2aWNlYWNjb3VudC9uYW1lc3BhY2UiOiJkZWZhdWx0Iiwia3ViZXJuZXRlcy5pby9zZXJ2aWNlYWNjb3VudC9zZWNyZXQubmFtZSI6ImE0YjI0ZmM1NThkMjJmYmQtdG9rZW4taHpjamciLCJrdWJlcm5ldGVzLmlvL3NlcnZpY2VhY2NvdW50L3NlcnZpY2UtYWNjb3VudC5uYW1lIjoiYTRiMjRmYzU1OGQyMmZiZCIsImt1YmVybmV0ZXMuaW8vc2VydmljZWFjY291bnQvc2VydmljZS1hY2NvdW50LnVpZCI6IjAyZGQxOWI5LTg3MGYtNGZkMy04OTNlLWU4OGQyOWZiMjZmMyIsInN1YiI6InN5c3RlbTpzZXJ2aWNlYWNjb3VudDpkZWZhdWx0OmE0YjI0ZmM1NThkMjJmYmQifQ.gWoKBJW2I1vV2cpFNjnPQCz2XTueM6Tsk3mgEEBOfYVqfB6ZxqNmuyNinUuaH6piEntL4KwkL1Gn_X8bSZvO_8VLSIFAo9uNBxtEwz7oB3MDPbTaJWjMM4Ed-zHWHRHiHZDsvZ-nWUWICj6NcrI-Uy3_cB7nA9IJZV2nsWL3HnNFGTQEP2UDaCItMcqQcTGADVgGlZ5eZSsxm00aSxT-VlnFfkQ-2hpzos0yi0rAbwaVZxUXuIHVOWmFnIBKy_DkADUxet_RiZFRq9rCbtlfgXJNgrR_jXc-dTsd7y3d8grTpscdh9FGKBCUk0g6vWvmgnStZ0aGqJGOfB8uMJ2CxA
            clusters:
            - cluster:
                certificate-authority-data: LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUM1ekNDQWMrZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJeU1ETXdNekUyTkRnek1Gb1hEVE15TURJeU9URTJORGd6TUZvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBTmNDCmRXWldQWGsrR0NPYkFEWlFObTZJTG4veHpuVGhnKzR1SUhCUjd3c213NUErRExIQlFlNi96Qjhqck9hNXFHdUIKMlNiS3FTaXRBT1ZTOTdxNEdLWXZKekV2bG1uVks2Lzg0ZWx4eXJjL2FFZWxjdmZLZE84NGtwTGNPeE9lWUpEYwpRVTZwZlFxN2FoejhLRkxvSnQvR3NlUi9VYzl0NjdkczZsNUVqTkZuam1IMEZ3bjZNaWxCcjlUWXZiSmsrYmF3CkwzeXErSjU1K1kyNnc5TXFzci9uOHFJQ0YyaUp5Y2lMMWJDOG5CUnp4NmVMOWhqekc1VzBpQVcvaHV5OVUxR3gKTGRxMytMU3pBNXRtekhRekpHekg3bUdVaEdJWi9xQkpwc3orRUhSeFdWVmhJWGVpSWNnWExKcmgzNWxaOFlDaApkSnVxb1ZlbmRONC96NzFZR0lFQ0F3RUFBYU5DTUVBd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0hRWURWUjBPQkJZRUZDdHB5TzErZ3VPNTc3TGl3ODBiR20xdkt6Q2RNQTBHQ1NxR1NJYjMKRFFFQkN3VUFBNElCQVFBaWNKV1ZqaDBxd1dFRWdsK2gvMm1BNzdUWFdEN0ltc3dHWE9PNUcwMGErcGtJU0R2bgpPbGpQQ2dxb3dpYmFQaTZrZjB0ZlFmTzc2UUp5eWJxV01Bai96bSs3Z3l4RGVSVGFkVGRablNRRG9sbDBDRnZmCkl5WlZESzJWZThXclUrVGJFT3lCSWk0ejFYV1JkeWx1M3R0WDZENXdBWFo1di84Z0ZWV3kzbDhzQ3BINmhYUk8KTUZlbUlvR0dXUFROYXg0a3BWcGFROHE4M1VFNGxMcnlWTGFGTEhjZStkQzlOS1dTc2xMVnRwa205TmFxVHpiNApZcHJZYklmWnUrRm1TS2ZyYU5xanFDUlJxb045c2VEeG53TUMvbFVReTQ4SG9ZSFhoRjhxUXdVaFZnN0M2dFoyCmVXZkFQcVFaUG1mWEZvb2V4akRRUHpHNG1BWVFBS1p6RXFvYgotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg==
                server: https://E97035E8E3B7536C8E5BAEA9123ECC97.gr7.us-west-2.eks.amazonaws.com
              name: k8s-d6e0b7fc580c3a4d
            contexts:
            - context:
                cluster: k8s-d6e0b7fc580c3a4d
                namespace: default
                user: a4b24fc558d22fbd
              name: k8s-d6e0b7fc580c3a4d-default-a4b24fc558d22fbd
            current-context: k8s-d6e0b7fc580c3a4d-default-a4b24fc558d22fbd
        EOT -> (known after apply)
      # Warning: this attribute value will no longer be marked as sensitive
      # after applying this change.
      ~ template = (sensitive) -> (known after apply)
    }

  # module.brokerpak-eks-terraform.module.provision.local_file.kubeconfig[0] will be created
  + resource "local_file" "kubeconfig" {
      + directory_permission = "0777"
      + file_permission      = "0600"
      + filename             = "kubeconfig-k8s-d6e0b7fc580c3a4d"
      + id                   = (known after apply)
      + sensitive_content    = (sensitive value)
    }

  # module.brokerpak-eks-terraform.module.provision.module.aws_load_balancer_controller.data.aws_caller_identity.current will be read during apply
  # (config refers to values not yet known)
 <= data "aws_caller_identity" "current"  {
      ~ account_id = "************" -> (known after apply)
      ~ arn        = "arn:aws:iam::054110281448:user/ssb-eks-broker" -> (known after apply)
      ~ id         = "************" -> (known after apply)
      ~ user_id    = "*********************" -> (known after apply)
    }

  # module.brokerpak-eks-terraform.module.provision.module.aws_load_balancer_controller.data.aws_eks_cluster.selected[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster" "selected"  {
      ~ arn                       = "arn:aws:eks:us-west-2:054110281448:cluster/k8s-d6e0b7fc580c3a4d" -> (known after apply)
      ~ certificate_authority     = [
          - {
              - data = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUM1ekNDQWMrZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJeU1ETXdNekUyTkRnek1Gb1hEVE15TURJeU9URTJORGd6TUZvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBTmNDCmRXWldQWGsrR0NPYkFEWlFObTZJTG4veHpuVGhnKzR1SUhCUjd3c213NUErRExIQlFlNi96Qjhqck9hNXFHdUIKMlNiS3FTaXRBT1ZTOTdxNEdLWXZKekV2bG1uVks2Lzg0ZWx4eXJjL2FFZWxjdmZLZE84NGtwTGNPeE9lWUpEYwpRVTZwZlFxN2FoejhLRkxvSnQvR3NlUi9VYzl0NjdkczZsNUVqTkZuam1IMEZ3bjZNaWxCcjlUWXZiSmsrYmF3CkwzeXErSjU1K1kyNnc5TXFzci9uOHFJQ0YyaUp5Y2lMMWJDOG5CUnp4NmVMOWhqekc1VzBpQVcvaHV5OVUxR3gKTGRxMytMU3pBNXRtekhRekpHekg3bUdVaEdJWi9xQkpwc3orRUhSeFdWVmhJWGVpSWNnWExKcmgzNWxaOFlDaApkSnVxb1ZlbmRONC96NzFZR0lFQ0F3RUFBYU5DTUVBd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0hRWURWUjBPQkJZRUZDdHB5TzErZ3VPNTc3TGl3ODBiR20xdkt6Q2RNQTBHQ1NxR1NJYjMKRFFFQkN3VUFBNElCQVFBaWNKV1ZqaDBxd1dFRWdsK2gvMm1BNzdUWFdEN0ltc3dHWE9PNUcwMGErcGtJU0R2bgpPbGpQQ2dxb3dpYmFQaTZrZjB0ZlFmTzc2UUp5eWJxV01Bai96bSs3Z3l4RGVSVGFkVGRablNRRG9sbDBDRnZmCkl5WlZESzJWZThXclUrVGJFT3lCSWk0ejFYV1JkeWx1M3R0WDZENXdBWFo1di84Z0ZWV3kzbDhzQ3BINmhYUk8KTUZlbUlvR0dXUFROYXg0a3BWcGFROHE4M1VFNGxMcnlWTGFGTEhjZStkQzlOS1dTc2xMVnRwa205TmFxVHpiNApZcHJZYklmWnUrRm1TS2ZyYU5xanFDUlJxb045c2VEeG53TUMvbFVReTQ4SG9ZSFhoRjhxUXdVaFZnN0M2dFoyCmVXZkFQcVFaUG1mWEZvb2V4akRRUHpHNG1BWVFBS1p6RXFvYgotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
            },
        ] -> (known after apply)
      ~ created_at                = "2022-03-03 16:42:30.494 +0000 UTC" -> (known after apply)
      ~ enabled_cluster_log_types = [
          - "api",
          - "audit",
          - "authenticator",
          - "controllerManager",
          - "scheduler",
        ] -> (known after apply)
      ~ endpoint                  = "https://E97035E8E3B7536C8E5BAEA9123ECC97.gr7.us-west-2.eks.amazonaws.com" -> (known after apply)
      ~ id                        = "********************" -> (known after apply)
      ~ identity                  = [
          - {
              - oidc = [
                  - {
                      - issuer = "https://oidc.eks.us-west-2.amazonaws.com/id/E97035E8E3B7536C8E5BAEA9123ECC97"
                    },
                ]
            },
        ] -> (known after apply)
      ~ kubernetes_network_config = [
          - {
              - ip_family         = "ipv4"
              - service_ipv4_cidr = "172.20.0.0/16"
            },
        ] -> (known after apply)
        name                      = "k8s-d6e0b7fc580c3a4d"
      ~ platform_version          = "eks.4" -> (known after apply)
      ~ role_arn                  = "arn:aws:iam::054110281448:role/k8s-d6e0b7fc580c3a4d-cluster-20220303163904249300000004" -> (known after apply)
      ~ status                    = "ACTIVE" -> (known after apply)
      ~ tags                      = {
          - "domain" = "solrcloud-k8s.ssb-staging.data.gov"
        } -> (known after apply)
      ~ version                   = "1.21" -> (known after apply)
      ~ vpc_config                = [
          - {
              - cluster_security_group_id = "********************"
              - endpoint_private_access   = false
              - endpoint_public_access    = true
              - public_access_cidrs       = [
                  - "0.0.0.0/0",
                ]
              - security_group_ids        = [
                  - "sg-033458e536cdfbf6e",
                ]
              - subnet_ids                = [
                  - "subnet-095181b79768c6bb2",
                  - "subnet-0ae384f0e2f4fdf5a",
                  - "subnet-0fb9117ab72a85725",
                ]
              - vpc_id                    = "*********************"
            },
        ] -> (known after apply)
    }

  # module.brokerpak-eks-terraform.module.provision.module.aws_load_balancer_controller.data.aws_eks_cluster_auth.selected[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster_auth" "selected"  {
      ~ id    = "********************" -> (known after apply)
        name  = "k8s-d6e0b7fc580c3a4d"
      ~ token = (sensitive value)
    }

  # module.brokerpak-eks-terraform.module.provision.module.aws_load_balancer_controller.data.aws_iam_policy_document.eks_oidc_assume_role[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "eks_oidc_assume_role"  {
      ~ id      = "**********" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - oidc.eks.us-west-2.amazonaws.com/id/E97035E8E3B7536C8E5BAEA9123ECC97:sub = "**************************************************************"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::054110281448:oidc-provider/oidc.eks.us-west-2.amazonaws.com/id/E97035E8E3B7536C8E5BAEA9123ECC97"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
          - resources     = [] -> null
            # (2 unchanged attributes hidden)

          - condition {
              - test     = "StringEquals" -> null
              - values   = [
                  - "system:serviceaccount:kube-system:aws-load-balancer-controller",
                ] -> null
              - variable = "oidc.eks.us-west-2.amazonaws.com/id/E97035E8E3B7536C8E5BAEA9123ECC97:sub" -> null
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:kube-system:aws-load-balancer-controller",
                ]
              + variable = (known after apply)
            }

          - principals {
              - identifiers = [
                  - "arn:aws:iam::054110281448:oidc-provider/oidc.eks.us-west-2.amazonaws.com/id/E97035E8E3B7536C8E5BAEA9123ECC97",
                ] -> null
              - type        = "Federated" -> null
            }
          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # module.brokerpak-eks-terraform.module.provision.module.aws_load_balancer_controller.data.aws_region.current will be read during apply
  # (config refers to values not yet known)
 <= data "aws_region" "current"  {
      ~ description = "US West (Oregon)" -> (known after apply)
      ~ endpoint    = "ec2.us-west-2.amazonaws.com" -> (known after apply)
      ~ id          = "*********" -> (known after apply)
        name        = "us-west-2"
    }

  # module.brokerpak-eks-terraform.module.provision.module.aws_load_balancer_controller.data.aws_vpc.selected will be read during apply
  # (config refers to values not yet known)
 <= data "aws_vpc" "selected"  {
      ~ arn                     = "arn:aws:ec2:us-west-2:054110281448:vpc/vpc-0bcc0130a52d137d9" -> (known after apply)
      ~ cidr_block              = "10.31.0.0/16" -> (known after apply)
      ~ cidr_block_associations = [
          - {
              - association_id = "********************************"
              - cidr_block     = "10.31.0.0/16"
              - state          = "associated"
            },
        ] -> (known after apply)
      ~ default                 = false -> (known after apply)
      ~ dhcp_options_id         = "*************" -> (known after apply)
      ~ enable_dns_hostnames    = true -> (known after apply)
      ~ enable_dns_support      = true -> (known after apply)
      ~ id                      = "*********************" -> (known after apply)
      ~ instance_tenancy        = "default" -> (known after apply)
      + ipv6_association_id     = (known after apply)
      + ipv6_cidr_block         = (known after apply)
      ~ main_route_table_id     = "*********************" -> (known after apply)
      ~ owner_id                = "************" -> (known after apply)
      + state                   = (known after apply)
      ~ tags                    = {
          - "Name"                                       = "eks-vpc"
          - "domain"                                     = "solrcloud-k8s.ssb-staging.data.gov"
          - "kubernetes.io/cluster/k8s-d6e0b7fc580c3a4d" = "shared"
        } -> (known after apply)
    }

  # module.brokerpak-eks-terraform.module.provision.module.aws_load_balancer_controller.data.template_file.kubeconfig will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "kubeconfig"  {
      ~ id       = "****************************************************************" -> (known after apply)
      ~ rendered = <<-EOT
            apiVersion: v1
            kind: Config
            current-context: terraform
            clusters:
            - name: k8s-d6e0b7fc580c3a4d
              cluster:
                certificate-authority-data: LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUM1ekNDQWMrZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJeU1ETXdNekUyTkRnek1Gb1hEVE15TURJeU9URTJORGd6TUZvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBTmNDCmRXWldQWGsrR0NPYkFEWlFObTZJTG4veHpuVGhnKzR1SUhCUjd3c213NUErRExIQlFlNi96Qjhqck9hNXFHdUIKMlNiS3FTaXRBT1ZTOTdxNEdLWXZKekV2bG1uVks2Lzg0ZWx4eXJjL2FFZWxjdmZLZE84NGtwTGNPeE9lWUpEYwpRVTZwZlFxN2FoejhLRkxvSnQvR3NlUi9VYzl0NjdkczZsNUVqTkZuam1IMEZ3bjZNaWxCcjlUWXZiSmsrYmF3CkwzeXErSjU1K1kyNnc5TXFzci9uOHFJQ0YyaUp5Y2lMMWJDOG5CUnp4NmVMOWhqekc1VzBpQVcvaHV5OVUxR3gKTGRxMytMU3pBNXRtekhRekpHekg3bUdVaEdJWi9xQkpwc3orRUhSeFdWVmhJWGVpSWNnWExKcmgzNWxaOFlDaApkSnVxb1ZlbmRONC96NzFZR0lFQ0F3RUFBYU5DTUVBd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0hRWURWUjBPQkJZRUZDdHB5TzErZ3VPNTc3TGl3ODBiR20xdkt6Q2RNQTBHQ1NxR1NJYjMKRFFFQkN3VUFBNElCQVFBaWNKV1ZqaDBxd1dFRWdsK2gvMm1BNzdUWFdEN0ltc3dHWE9PNUcwMGErcGtJU0R2bgpPbGpQQ2dxb3dpYmFQaTZrZjB0ZlFmTzc2UUp5eWJxV01Bai96bSs3Z3l4RGVSVGFkVGRablNRRG9sbDBDRnZmCkl5WlZESzJWZThXclUrVGJFT3lCSWk0ejFYV1JkeWx1M3R0WDZENXdBWFo1di84Z0ZWV3kzbDhzQ3BINmhYUk8KTUZlbUlvR0dXUFROYXg0a3BWcGFROHE4M1VFNGxMcnlWTGFGTEhjZStkQzlOS1dTc2xMVnRwa205TmFxVHpiNApZcHJZYklmWnUrRm1TS2ZyYU5xanFDUlJxb045c2VEeG53TUMvbFVReTQ4SG9ZSFhoRjhxUXdVaFZnN0M2dFoyCmVXZkFQcVFaUG1mWEZvb2V4akRRUHpHNG1BWVFBS1p6RXFvYgotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg==
                server: https://E97035E8E3B7536C8E5BAEA9123ECC97.gr7.us-west-2.eks.amazonaws.com
            contexts:
            - name: terraform
              context:
                cluster: k8s-d6e0b7fc580c3a4d
                user: terraform
            users:
            - name: terraform
              user:
                token: k8s-aws-v1.aHR0cHM6Ly9zdHMuYW1hem9uYXdzLmNvbS8_QWN0aW9uPUdldENhbGxlcklkZW50aXR5JlZlcnNpb249MjAxMS0wNi0xNSZYLUFtei1BbGdvcml0aG09QVdTNC1ITUFDLVNIQTI1NiZYLUFtei1DcmVkZW50aWFsPUFLSUFRWkdKWkwzVUJNTVFaWTRFJTJGMjAyMjAzMDMlMkZ1cy1lYXN0LTElMkZzdHMlMkZhd3M0X3JlcXVlc3QmWC1BbXotRGF0ZT0yMDIyMDMwM1QxNzQyNDRaJlgtQW16LUV4cGlyZXM9MCZYLUFtei1TaWduZWRIZWFkZXJzPWhvc3QlM0J4LWs4cy1hd3MtaWQmWC1BbXotU2lnbmF0dXJlPTBmYjcxNmRlZjMyYTkzZDFlZjM3N2EyNmRiMjdkNWEzNzM5NGVhZjFlYTMwNGRlNDkwZDMwZmJlOWY5NzUyY2M
        EOT -> (known after apply)
      ~ template = (sensitive) -> (sensitive)
    }

  # module.brokerpak-eks-terraform.module.provision.module.aws_load_balancer_controller.aws_iam_role.this will be updated in-place
  ~ resource "aws_iam_role" "this" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - oidc.eks.us-west-2.amazonaws.com/id/E97035E8E3B7536C8E5BAEA9123ECC97:sub = "**************************************************************"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::054110281448:oidc-provider/oidc.eks.us-west-2.amazonaws.com/id/E97035E8E3B7536C8E5BAEA9123ECC97"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "k8s-k8s-d6e0b7fc580c3a4d-aws-load-balancer-controller"
        name                  = "k8s-k8s-d6e0b7fc580c3a4d-aws-load-balancer-controller"
        tags                  = {
            "domain" = "solrcloud-k8s.ssb-staging.data.gov"
        }
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.brokerpak-eks-terraform.module.provision.module.aws_load_balancer_controller.helm_release.alb_controller will be updated in-place
  ~ resource "helm_release" "alb_controller" {
        id                         = "aws-load-balancer-controller"
        name                       = "aws-load-balancer-controller"
        # (26 unchanged attributes hidden)

      - set {
          - name  = "clusterName" -> null
          - value = "k8s-d6e0b7fc580c3a4d" -> null
        }
      + set {
          + name  = "clusterName"
          + value = "k8s-d6e0b7fc580c3a4d"
        }
      - set {
          - name  = "hostNetwork" -> null
          - value = "false" -> null
        }
      + set {
          + name  = "hostNetwork"
          + value = "false"
        }
      - set {
          - name  = "region" -> null
          - value = "us-west-2" -> null
        }
      + set {
          + name  = "region"
          + value = "us-west-2"
        }
      - set {
          - name  = "serviceAccount.create" -> null
          - value = "false" -> null
        }
      + set {
          + name  = "serviceAccount.create"
          + value = "false"
        }
      - set {
          - name  = "serviceAccount.name" -> null
          - value = "aws-load-balancer-controller" -> null
        }
      + set {
          + name  = "serviceAccount.name"
          + value = "aws-load-balancer-controller"
        }
      - set {
          - name  = "vpcId" -> null
          - value = "vpc-0bcc0130a52d137d9" -> null
        }
      + set {
          + name  = "vpcId"
          + value = (known after apply)
        }
    }

  # module.brokerpak-eks-terraform.module.provision.module.eks.module.eks_managed_node_group["system_node_group"].aws_eks_node_group.this[0] will be updated in-place
  ~ resource "aws_eks_node_group" "this" {
        id                     = "k8s-d6e0b7fc580c3a4d:mng-d6e0b7fc580c3a4d-20220303165234828900000012"
        tags                   = {
            "Name"   = "mng-d6e0b7fc580c3a4d"
            "domain" = "solrcloud-k8s.ssb-staging.data.gov"
        }
        # (16 unchanged attributes hidden)

      ~ launch_template {
            id      = "lt-01913654fa0f8db77"
            name    = "system_node_group-2022030316523334020000000f"
          ~ version = "1" -> (known after apply)
        }



        # (3 unchanged blocks hidden)
    }

  # module.brokerpak-eks-terraform.module.provision.module.eks.module.eks_managed_node_group["system_node_group"].aws_launch_template.this[0] will be updated in-place
  ~ resource "aws_launch_template" "this" {
      ~ default_version         = 1 -> (known after apply)
        id                      = "lt-01913654fa0f8db77"
      ~ latest_version          = 1 -> (known after apply)
        name                    = "system_node_group-2022030316523334020000000f"
        tags                    = {
            "domain" = "solrcloud-k8s.ssb-staging.data.gov"
        }
        # (8 unchanged attributes hidden)

      + block_device_mappings {
          + device_name = "/dev/xvda"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "***************************************************************************"
              + volume_size           = 20
            }
        }



        # (5 unchanged blocks hidden)
    }

Plan: 1 to add, 8 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [plan #200](https://github.com/GSA/datagov-ssb/actions/runs/1930592325)